results/ab.out
===========================================================================
WARM-UP
$ /c/Program_dev/Apache24/bin
$ ./ab.exe -n 1000 -c 4 -l http://localhost:8771/http-client-shop/orderHat
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            8771

Document Path:          /http-client-shop/orderHat
Document Length:        Variable

Concurrency Level:      4
Time taken for tests:   9.513 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      166782 bytes
HTML transferred:       80782 bytes
Requests per second:    105.12 [#/sec] (mean)
Time per request:       38.052 [ms] (mean)
Time per request:       9.513 [ms] (mean, across all concurrent requests)
Transfer rate:          17.12 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   1.1      1      27
Processing:    13   35  17.0     33     380
Waiting:       13   35  16.9     32     376
Total:         15   37  17.1     34     382

Percentage of the requests served within a certain time (ms)
  50%     34
  66%     40
  75%     44
  80%     46
  90%     55
  95%     62
  98%     71
  99%     80
 100%    382 (longest request)

===========================================================================
REAL MEASUREMENTS
$ /c/Program_dev/Apache24/bin
$ ./ab.exe -n 5000 -c 4 -l http://localhost:8771/http-client-shop/orderHat
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:
Server Hostname:        localhost
Server Port:            8771

Document Path:          /http-client-shop/orderHat
Document Length:        Variable

Concurrency Level:      4
Time taken for tests:   27.701 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      833886 bytes
HTML transferred:       403886 bytes
Requests per second:    180.50 [#/sec] (mean)
Time per request:       22.161 [ms] (mean)
Time per request:       5.540 [ms] (mean, across all concurrent requests)
Transfer rate:          29.40 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   1.0      1      35
Processing:     8   21  14.2     18     293
Waiting:        8   20  14.1     17     293
Total:          9   22  14.3     19     294

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     22
  75%     25
  80%     27
  90%     33
  95%     42
  98%     57
  99%     71
 100%    294 (longest request)